import 'dart:convert';

import 'package:flutter/material.dart';
import 'package:json_table/json_table.dart';

class JibangJSON extends StatefulWidget {
  const JibangJSON({Key? key}) : super(key: key);

  @override
  _JibangJSONState createState() => _JibangJSONState();
}

class _JibangJSONState extends State<JibangJSON> {
  final String jsonSample =
      '[ { "년" : "2012", "월" : "2", "KOSPI" : "2030.25", "경제성장률" : "2.4", "GDP" : "30.8", "초중고합계" : "7196" } , { "년" : "2012", "월" : "3", "KOSPI" : "2014.04", "경제성장률" : "2.4", "GDP" : "30.8", "초중고합계" : "7196" } , { "년" : "2012", "월" : "4", "KOSPI" : "1981.99", "경제성장률" : "2.4", "GDP" : "30.8", "초중고합계" : "7196" } , { "년" : "2012", "월" : "5", "KOSPI" : "1843.47", "경제성장률" : "2.4", "GDP" : "30.8", "초중고합계" : "7196" } , { "년" : "2012", "월" : "6", "KOSPI" : "1854.01", "경제성장률" : "2.4", "GDP" : "30.8", "초중고합계" : "7196" } , { "년" : "2012", "월" : "7", "KOSPI" : "1881.99", "경제성장률" : "2.4", "GDP" : "30.8", "초중고합계" : "7196" } , { "년" : "2012", "월" : "8", "KOSPI" : "1905.12", "경제성장률" : "2.4", "GDP" : "30.8", "초중고합계" : "7196" } , { "년" : "2012", "월" : "9", "KOSPI" : "1996.21", "경제성장률" : "2.4", "GDP" : "30.8", "초중고합계" : "7196" } , { "년" : "2012", "월" : "10", "KOSPI" : "1912.06", "경제성장률" : "2.4", "GDP" : "30.8", "초중고합계" : "7196" } , { "년" : "2012", "월" : "11", "KOSPI" : "1932.9", "경제성장률" : "2.4", "GDP" : "30.8", "초중고합계" : "7196" } , { "년" : "2012", "월" : "12", "KOSPI" : "1997.05", "경제성장률" : "2.4", "GDP" : "30.8", "초중고합계" : "7196" } , { "년" : "2013", "월" : "1", "KOSPI" : "1961.94", "경제성장률" : "3.2", "GDP" : "32.6", "초중고합계" : "7201" } , { "년" : "2013", "월" : "2", "KOSPI" : "2026.49", "경제성장률" : "3.2", "GDP" : "32.6", "초중고합계" : "7201" } , { "년" : "2013", "월" : "3", "KOSPI" : "2004.89", "경제성장률" : "3.2", "GDP" : "32.6", "초중고합계" : "7201" } , { "년" : "2013", "월" : "4", "KOSPI" : "1963.95", "경제성장률" : "3.2", "GDP" : "32.6", "초중고합계" : "7201" } , { "년" : "2013", "월" : "5", "KOSPI" : "2001.05", "경제성장률" : "3.2", "GDP" : "32.6", "초중고합계" : "7201" } , { "년" : "2013", "월" : "6", "KOSPI" : "1863.32", "경제성장률" : "3.2", "GDP" : "32.6", "초중고합계" : "7201" } , { "년" : "2013", "월" : "7", "KOSPI" : "1914.03", "경제성장률" : "3.2", "GDP" : "32.6", "초중고합계" : "7201" } , { "년" : "2013", "월" : "8", "KOSPI" : "1926.36", "경제성장률" : "3.2", "GDP" : "32.6", "초중고합계" : "7201" } , { "년" : "2013", "월" : "9", "KOSPI" : "1996.96", "경제성장률" : "3.2", "GDP" : "32.6", "초중고합계" : "7201" } , { "년" : "2013", "월" : "10", "KOSPI" : "2030.09", "경제성장률" : "3.2", "GDP" : "32.6", "초중고합계" : "7201" } , { "년" : "2013", "월" : "11", "KOSPI" : "2044.87", "경제성장률" : "3.2", "GDP" : "32.6", "초중고합계" : "7201" } , { "년" : "2013", "월" : "12", "KOSPI" : "2011.34", "경제성장률" : "3.2", "GDP" : "32.6", "초중고합계" : "7201" } , { "년" : "2014", "월" : "2", "KOSPI" : "1979.99", "경제성장률" : "3.2", "GDP" : "34.1", "초중고합계" : "7214" } , { "년" : "2014", "월" : "3", "KOSPI" : "1985.61", "경제성장률" : "3.2", "GDP" : "34.1", "초중고합계" : "7214" } , { "년" : "2014", "월" : "4", "KOSPI" : "1961.79", "경제성장률" : "3.2", "GDP" : "34.1", "초중고합계" : "7214" } , { "년" : "2014", "월" : "5", "KOSPI" : "1994.96", "경제성장률" : "3.2", "GDP" : "34.1", "초중고합계" : "7214" } , { "년" : "2014", "월" : "6", "KOSPI" : "2002.21", "경제성장률" : "3.2", "GDP" : "34.1", "초중고합계" : "7214" } , { "년" : "2014", "월" : "7", "KOSPI" : "2076.12", "경제성장률" : "3.2", "GDP" : "34.1", "초중고합계" : "7214" } , { "년" : "2014", "월" : "8", "KOSPI" : "2068.54", "경제성장률" : "3.2", "GDP" : "34.1", "초중고합계" : "7214" } , { "년" : "2014", "월" : "9", "KOSPI" : "2020.09", "경제성장률" : "3.2", "GDP" : "34.1", "초중고합계" : "7214" } , { "년" : "2014", "월" : "10", "KOSPI" : "1964.43", "경제성장률" : "3.2", "GDP" : "34.1", "초중고합계" : "7214" } , { "년" : "2014", "월" : "11", "KOSPI" : "1980.78", "경제성장률" : "3.2", "GDP" : "34.1", "초중고합계" : "7214" } , { "년" : "2014", "월" : "12", "KOSPI" : "1915.59", "경제성장률" : "3.2", "GDP" : "34.1", "초중고합계" : "7214" } , { "년" : "2015", "월" : "1", "KOSPI" : "1949.26", "경제성장률" : "2.8", "GDP" : "35.7", "초중고합계" : "7252" } , { "년" : "2015", "월" : "2", "KOSPI" : "1985.8", "경제성장률" : "2.8", "GDP" : "35.7", "초중고합계" : "7252" } , { "년" : "2015", "월" : "3", "KOSPI" : "2041.03", "경제성장률" : "2.8", "GDP" : "35.7", "초중고합계" : "7252" } , { "년" : "2015", "월" : "4", "KOSPI" : "2127.17", "경제성장률" : "2.8", "GDP" : "35.7", "초중고합계" : "7252" } , { "년" : "2015", "월" : "5", "KOSPI" : "2114.8", "경제성장률" : "2.8", "GDP" : "35.7", "초중고합계" : "7252" } , { "년" : "2015", "월" : "6", "KOSPI" : "2074.2", "경제성장률" : "2.8", "GDP" : "35.7", "초중고합계" : "7252" } , { "년" : "2015", "월" : "8", "KOSPI" : "1941.49", "경제성장률" : "2.8", "GDP" : "35.7", "초중고합계" : "7252" } , { "년" : "2015", "월" : "9", "KOSPI" : "1962.81", "경제성장률" : "2.8", "GDP" : "35.7", "초중고합계" : "7252" } , { "년" : "2015", "월" : "10", "KOSPI" : "2029.47", "경제성장률" : "2.8", "GDP" : "35.7", "초중고합계" : "7252" } , { "년" : "2015", "월" : "11", "KOSPI" : "1991.97", "경제성장률" : "2.8", "GDP" : "35.7", "초중고합계" : "7252" } , { "년" : "2015", "월" : "12", "KOSPI" : "1961.31", "경제성장률" : "2.8", "GDP" : "35.7", "초중고합계" : "7252" } , { "년" : "2016", "월" : "1", "KOSPI" : "1912.06", "경제성장률" : "2.9", "GDP" : "36.0", "초중고합계" : "7251" } , { "년" : "2016", "월" : "2", "KOSPI" : "1916.66", "경제성장률" : "2.9", "GDP" : "36.0", "초중고합계" : "7251" } , { "년" : "2016", "월" : "3", "KOSPI" : "1995.85", "경제성장률" : "2.9", "GDP" : "36.0", "초중고합계" : "7251" } , { "년" : "2016", "월" : "4", "KOSPI" : "1994.15", "경제성장률" : "2.9", "GDP" : "36.0", "초중고합계" : "7251" } , { "년" : "2016", "월" : "5", "KOSPI" : "1983.4", "경제성장률" : "2.9", "GDP" : "36.0", "초중고합계" : "7251" } , { "년" : "2016", "월" : "6", "KOSPI" : "1970.35", "경제성장률" : "2.9", "GDP" : "36.0", "초중고합계" : "7251" } , { "년" : "2016", "월" : "7", "KOSPI" : "2016.19", "경제성장률" : "2.9", "GDP" : "36.0", "초중고합계" : "7251" } , { "년" : "2016", "월" : "8", "KOSPI" : "2034.65", "경제성장률" : "2.9", "GDP" : "36.0", "초중고합계" : "7251" } , { "년" : "2016", "월" : "9", "KOSPI" : "2043.63", "경제성장률" : "2.9", "GDP" : "36.0", "초중고합계" : "7251" } , { "년" : "2016", "월" : "10", "KOSPI" : "2008.19", "경제성장률" : "2.9", "GDP" : "36.0", "초중고합계" : "7251" } , { "년" : "2016", "월" : "11", "KOSPI" : "1983.48", "경제성장률" : "2.9", "GDP" : "36.0", "초중고합계" : "7251" } , { "년" : "2016", "월" : "12", "KOSPI" : "2026.46", "경제성장률" : "2.9", "GDP" : "36.0", "초중고합계" : "7251" } , { "년" : "2017", "월" : "1", "KOSPI" : "2067.57", "경제성장률" : "3.2", "GDP" : "36.0", "초중고합계" : "7273" } , { "년" : "2017", "월" : "2", "KOSPI" : "2091.64", "경제성장률" : "3.2", "GDP" : "36.0", "초중고합계" : "7273" } , { "년" : "2017", "월" : "3", "KOSPI" : "2160.23", "경제성장률" : "3.2", "GDP" : "36.0", "초중고합계" : "7273" } , { "년" : "2017", "월" : "4", "KOSPI" : "2205.44", "경제성장률" : "3.2", "GDP" : "36.0", "초중고합계" : "7273" } , { "년" : "2017", "월" : "5", "KOSPI" : "2347.38", "경제성장률" : "3.2", "GDP" : "36.0", "초중고합계" : "7273" } , { "년" : "2017", "월" : "6", "KOSPI" : "2391.79", "경제성장률" : "3.2", "GDP" : "36.0", "초중고합계" : "7273" } , { "년" : "2017", "월" : "7", "KOSPI" : "2402.71", "경제성장률" : "3.2", "GDP" : "36.0", "초중고합계" : "7273" } , { "년" : "2017", "월" : "8", "KOSPI" : "2363.19", "경제성장률" : "3.2", "GDP" : "36.0", "초중고합계" : "7273" } , { "년" : "2017", "월" : "9", "KOSPI" : "2394.47", "경제성장률" : "3.2", "GDP" : "36.0", "초중고합계" : "7273" } , { "년" : "2017", "월" : "10", "KOSPI" : "2523.43", "경제성장률" : "3.2", "GDP" : "36.0", "초중고합계" : "7273" } , { "년" : "2017", "월" : "11", "KOSPI" : "2476.37", "경제성장률" : "3.2", "GDP" : "36.0", "초중고합계" : "7273" } , { "년" : "2018", "월" : "1", "KOSPI" : "2566.46", "경제성장률" : "2.9", "GDP" : "35.9", "초중고합계" : "7270" } , { "년" : "2018", "월" : "2", "KOSPI" : "2427.36", "경제성장률" : "2.9", "GDP" : "35.9", "초중고합계" : "7270" } , { "년" : "2018", "월" : "3", "KOSPI" : "2445.85", "경제성장률" : "2.9", "GDP" : "35.9", "초중고합계" : "7270" } , { "년" : "2018", "월" : "4", "KOSPI" : "2515.38", "경제성장률" : "2.9", "GDP" : "35.9", "초중고합계" : "7270" } , { "년" : "2018", "월" : "5", "KOSPI" : "2423.01", "경제성장률" : "2.9", "GDP" : "35.9", "초중고합계" : "7270" } , { "년" : "2018", "월" : "6", "KOSPI" : "2326.13", "경제성장률" : "2.9", "GDP" : "35.9", "초중고합계" : "7270" } , { "년" : "2018", "월" : "7", "KOSPI" : "2295.26", "경제성장률" : "2.9", "GDP" : "35.9", "초중고합계" : "7270" } , { "년" : "2018", "월" : "8", "KOSPI" : "2322.88", "경제성장률" : "2.9", "GDP" : "35.9", "초중고합계" : "7270" } , { "년" : "2018", "월" : "9", "KOSPI" : "2343.07", "경제성장률" : "2.9", "GDP" : "35.9", "초중고합계" : "7270" } , { "년" : "2018", "월" : "10", "KOSPI" : "2029.69", "경제성장률" : "2.9", "GDP" : "35.9", "초중고합계" : "7270" } , { "년" : "2018", "월" : "11", "KOSPI" : "2096.86", "경제성장률" : "2.9", "GDP" : "35.9", "초중고합계" : "7270" } , { "년" : "2018", "월" : "12", "KOSPI" : "2041.04", "경제성장률" : "2.9", "GDP" : "35.9", "초중고합계" : "7270" } , { "년" : "2019", "월" : "2", "KOSPI" : "2195.44", "경제성장률" : "2.2", "GDP" : "37.6", "초중고합계" : "7264" } , { "년" : "2019", "월" : "3", "KOSPI" : "2140.67", "경제성장률" : "2.2", "GDP" : "37.6", "초중고합계" : "7264" } , { "년" : "2019", "월" : "4", "KOSPI" : "2203.59", "경제성장률" : "2.2", "GDP" : "37.6", "초중고합계" : "7264" } , { "년" : "2019", "월" : "5", "KOSPI" : "2041.74", "경제성장률" : "2.2", "GDP" : "37.6", "초중고합계" : "7264" } , { "년" : "2019", "월" : "6", "KOSPI" : "2130.62", "경제성장률" : "2.2", "GDP" : "37.6", "초중고합계" : "7264" } , { "년" : "2019", "월" : "7", "KOSPI" : "2024.55", "경제성장률" : "2.2", "GDP" : "37.6", "초중고합계" : "7264" } , { "년" : "2019", "월" : "8", "KOSPI" : "1967.79", "경제성장률" : "2.2", "GDP" : "37.6", "초중고합계" : "7264" } , { "년" : "2019", "월" : "9", "KOSPI" : "2063.05", "경제성장률" : "2.2", "GDP" : "37.6", "초중고합계" : "7264" } , { "년" : "2019", "월" : "10", "KOSPI" : "2083.48", "경제성장률" : "2.2", "GDP" : "37.6", "초중고합계" : "7264" } , { "년" : "2019", "월" : "11", "KOSPI" : "2087.96", "경제성장률" : "2.2", "GDP" : "37.6", "초중고합계" : "7264" } , { "년" : "2019", "월" : "12", "KOSPI" : "2197.67", "경제성장률" : "2.2", "GDP" : "37.6", "초중고합계" : "7264" } , { "년" : "2020", "월" : "2", "KOSPI" : "1987.01", "경제성장률" : "-0.9", "GDP" : "43.8", "초중고합계" : "7278" } , { "년" : "2020", "월" : "3", "KOSPI" : "1754.64", "경제성장률" : "-0.9", "GDP" : "43.8", "초중고합계" : "7278" } , { "년" : "2020", "월" : "4", "KOSPI" : "1947.56", "경제성장률" : "-0.9", "GDP" : "43.8", "초중고합계" : "7278" } , { "년" : "2020", "월" : "5", "KOSPI" : "2029.6", "경제성장률" : "-0.9", "GDP" : "43.8", "초중고합계" : "7278" } , { "년" : "2020", "월" : "6", "KOSPI" : "2108.33", "경제성장률" : "-0.9", "GDP" : "43.8", "초중고합계" : "7278" } , { "년" : "2020", "월" : "10", "KOSPI" : "2267.15", "경제성장률" : "-0.9", "GDP" : "43.8", "초중고합계" : "7278" } , { "년" : "2021", "월" : "3", "KOSPI" : "3061.42", "경제성장률" : "-0.9", "GDP" : "47.3", "초중고합계" : "7278" } , { "년" : "2021", "월" : "4", "KOSPI" : "3147.86", "경제성장률" : "-0.9", "GDP" : "47.3", "초중고합계" : "7278" } , { "년" : "2021", "월" : "5", "KOSPI" : "3203.92", "경제성장률" : "-0.9", "GDP" : "47.3", "초중고합계" : "7278" } , { "년" : "2021", "월" : "8", "KOSPI" : "3199.27", "경제성장률" : "-0.9", "GDP" : "47.3", "초중고합계" : "7278" } , { "년" : "2021", "월" : "9", "KOSPI" : "3068.82", "경제성장률" : "-0.9", "GDP" : "47.3", "초중고합계" : "7278" } ]';
  bool toggle = true;

  @override
  Widget build(BuildContext context) {
    var json = jsonDecode(jsonSample);
    return Scaffold(
      appBar: AppBar(
        title: const Text('데이터'),
        backgroundColor: Colors.orange,
      ),
      body: SingleChildScrollView(
        padding: const EdgeInsets.fromLTRB(11, 50, 11, 0),
        child: Container(
          child: toggle
              ? Column(
                  children: [
                    JsonTable(
                      json,
                      showColumnToggle: true,
                      allowRowHighlight: true,
                      rowHighlightColor: Colors.yellow[500]!.withOpacity(0.7),
                      paginationRowCount: 11,
                      onRowSelect: (index, map) {
                        print(index);
                        print(map);
                      },
                    ),
                    const SizedBox(
                      height: 40.0,
                    ),
                    const Text("지역 : 비수도권"),
                    const Text("기간 : 2012년 2월 ~ 2021년 9월"),
                  ],
                )
              : Center(
                  child: Text(getPrettyJSONString(jsonSample)),
                ),
        ),
      ),
    );
  }

  String getPrettyJSONString(jsonObject) {
    JsonEncoder encoder = const JsonEncoder.withIndent('  ');
    String jsonString = encoder.convert(json.decode(jsonObject));
    return jsonString;
  }
}
